
## :x: Apply Failed

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3121184192)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/5867bd5d-7dfc-47ba-a336-c4e556a4d543/terraform-bin apply -auto-approve -input=false
data.http.ghactions_oidc_config: Reading...
data.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
data.tls_certificate.ghactions: Reading...
data.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
aws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.memo_board_tf_exec: Reading...
aws_iam_user.memo_board: Refreshing state... [id=memo-board]
aws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]
data.aws_iam_policy_document.memo_board_tf1: Reading...
data.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]
data.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3554073839]
aws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]
data.aws_iam_policy_document.memo_board_cd: Reading...
data.aws_iam_policy_document.memo_board_tf: Reading...
data.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]
data.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]
aws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]
aws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]
aws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]
aws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]
data.aws_iam_policy_document.memo_board_cd1: Reading...
data.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]
aws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.memo_board_cd1 will be updated in-place
  ~ resource "aws_iam_policy" "memo_board_cd1" {
        id        = "arn:aws:iam::281036478087:policy/memo_board_cd1"
        name      = "memo_board_cd1"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "ecr:GetAuthorizationToken" -> [
                          + "ecs:RegisterTaskDefinition",
                          + "ecr:GetAuthorizationToken",
                        ]
                      ~ Sid      = "GetAuthorizationToken" -> "AllowForGeneralResources"
                        # (2 unchanged elements hidden)
                    },
                    {
                        Action   = [
                            "ecr:UploadLayerPart",
                            "ecr:PutImage",
                            "ecr:InitiateLayerUpload",
                            "ecr:GetDownloadUrlForLayer",
                            "ecr:CompleteLayerUpload",
                            "ecr:BatchGetImage",
                            "ecr:BatchCheckLayerAvailability",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:ap-northeast-1:281036478087:repository/memo-board-rs"
                        Sid      = "AllowPushPull"
                    },
                  + {
                      + Action   = [
                          + "ecs:UpdateService",
                          + "ecs:DescribeServices",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowForECS"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowPassRole"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.memo_board_tf1 will be updated in-place
  ~ resource "aws_iam_policy" "memo_board_tf1" {
        id        = "arn:aws:iam::281036478087:policy/memo_board_tf1"
        name      = "memo_board_tf1"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::hiyoko3m-tfstate/memo_board"
                        Sid      = ""
                    },
                  ~ {
                      ~ Action   = [
                          - "ecs:*",
                          - "ecr:*",
                          + "iam:SimulatePrincipalPolicy",
                          + "iam:SimulateCustomPolicy",
                          + "iam:List*",
                          + "iam:Get*",
                          + "iam:GenerateServiceLastAccessedDetails",
                          + "iam:GenerateCredentialReport",
                        ]
                      ~ Sid      = "" -> "IAMReadOnlyAccess"
                        # (2 unchanged elements hidden)
                    },
                  + {
                      + Action   = [
                          + "logs:TestMetricFilter",
                          + "logs:StopQuery",
                          + "logs:StartQuery",
                          + "logs:List*",
                          + "logs:Get*",
                          + "logs:FilterLogEvents",
                          + "logs:Describe*",
                          + "cloudwatch:List*",
                          + "cloudwatch:Get*",
                          + "cloudwatch:Describe*",
                          + "autoscaling:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchReadOnlyAccess (partial)"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:Describe*",
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AmazonEC2ReadOnlyAccess (partial)"
                    },
                  + {
                      + Action   = [
                          + "ecr:List*",
                          + "ecr:Get*",
                          + "ecr:Describe*",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AmazonEC2ContainerRegistryReadOnly (modified)"
                    },
                  + {
                      + Action   = [
                          + "ecs:List*",
                          + "ecs:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.memo_board_tf_exec will be created
  + resource "aws_iam_policy" "memo_board_tf_exec" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "memo_board_tf_exec"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "IAMFullAccess"
                    },
                  + {
                      + Action   = [
                          + "logs:*",
                          + "elasticloadbalancing:*",
                          + "ecs:*",
                          + "ecr:*",
                          + "ec2:*",
                          + "cloudwatch:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.memo_board_tf_exec will be created
  + resource "aws_iam_role_policy_attachment" "memo_board_tf_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "memo-board-tf"
    }

Plan: 2 to add, 2 to change, 0 to destroy.
aws_iam_policy.memo_board_tf_exec: Creating...
aws_iam_policy.memo_board_cd1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_policy.memo_board_tf1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]
aws_iam_policy.memo_board_tf_exec: Creation complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]
aws_iam_role_policy_attachment.memo_board_tf_exec: Creating...
aws_iam_policy.memo_board_cd1: Modifications complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_role_policy_attachment.memo_board_tf_exec: Creation complete after 0s [id=memo-board-tf-20220925063856285400000001]
╷
│ Error: error updating IAM policy arn:aws:iam::281036478087:policy/memo_board_tf1: MalformedPolicyDocument: Statement IDs (SID) must be alpha-numeric. Check that your input satisfies the regular expression [0-9A-Za-z]*
│ 	status code: 400, request id: 55ff3939-bd23-478e-b1ec-d0bbede1f674
│ 
│   with aws_iam_policy.memo_board_tf1,
│   on iam.tf line 135, in resource "aws_iam_policy" "memo_board_tf1":
│  135: resource "aws_iam_policy" "memo_board_tf1" {
│ 
╵
::debug::Terraform exited with code 1.
::debug::stdout: data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3554073839]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_policy.memo_board_cd1 will be updated in-place%0A  ~ resource "aws_iam_policy" "memo_board_cd1" {%0A        id        = "arn:aws:iam::281036478087:policy/memo_board_cd1"%0A        name      = "memo_board_cd1"%0A      ~ policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Action   = "ecr:GetAuthorizationToken" -> [%0A                          + "ecs:RegisterTaskDefinition",%0A                          + "ecr:GetAuthorizationToken",%0A                        ]%0A                      ~ Sid      = "GetAuthorizationToken" -> "AllowForGeneralResources"%0A                        # (2 unchanged elements hidden)%0A                    },%0A                    {%0A                        Action   = [%0A                            "ecr:UploadLayerPart",%0A                            "ecr:PutImage",%0A                            "ecr:InitiateLayerUpload",%0A                            "ecr:GetDownloadUrlForLayer",%0A                            "ecr:CompleteLayerUpload",%0A                            "ecr:BatchGetImage",%0A                            "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                        Effect   = "Allow"%0A                        Resource = "arn:aws:ecr:ap-northeast-1:281036478087:repository/memo-board-rs"%0A                        Sid      = "AllowPushPull"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ecs:UpdateService",%0A                          + "ecs:DescribeServices",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AllowForECS"%0A                    },%0A                  + {%0A                      + Action   = "iam:PassRole"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AllowPassRole"%0A                    },%0A                ]%0A                # (1 unchanged element hidden)%0A            }%0A        )%0A        tags      = {}%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_policy.memo_board_tf1 will be updated in-place%0A  ~ resource "aws_iam_policy" "memo_board_tf1" {%0A        id        = "arn:aws:iam::281036478087:policy/memo_board_tf1"%0A        name      = "memo_board_tf1"%0A      ~ policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                    # (1 unchanged element hidden)%0A                    {%0A                        Action   = [%0A                            "s3:PutObject",%0A                            "s3:GetObject",%0A                            "s3:DeleteObject",%0A                        ]%0A                        Effect   = "Allow"%0A                        Resource = "arn:aws:s3:::hiyoko3m-tfstate/memo_board"%0A                        Sid      = ""%0A                    },%0A                  ~ {%0A                      ~ Action   = [%0A                          - "ecs:*",%0A                          - "ecr:*",%0A                          + "iam:SimulatePrincipalPolicy",%0A                          + "iam:SimulateCustomPolicy",%0A                          + "iam:List*",%0A                          + "iam:Get*",%0A                          + "iam:GenerateServiceLastAccessedDetails",%0A                          + "iam:GenerateCredentialReport",%0A                        ]%0A                      ~ Sid      = "" -> "IAMReadOnlyAccess"%0A                        # (2 unchanged elements hidden)%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "logs:TestMetricFilter",%0A                          + "logs:StopQuery",%0A                          + "logs:StartQuery",%0A                          + "logs:List*",%0A                          + "logs:Get*",%0A                          + "logs:FilterLogEvents",%0A                          + "logs:Describe*",%0A                          + "cloudwatch:List*",%0A                          + "cloudwatch:Get*",%0A                          + "cloudwatch:Describe*",%0A                          + "autoscaling:Describe*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "CloudWatchReadOnlyAccess (partial)"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:Describe*",%0A                          + "ec2:Describe*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AmazonEC2ReadOnlyAccess (partial)"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ecr:List*",%0A                          + "ecr:Get*",%0A                          + "ecr:Describe*",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AmazonEC2ContainerRegistryReadOnly (modified)"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ecs:List*",%0A                          + "ecs:Describe*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = ""%0A                    },%0A                ]%0A                # (1 unchanged element hidden)%0A            }%0A        )%0A        tags      = {}%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_policy.memo_board_tf_exec will be created%0A  + resource "aws_iam_policy" "memo_board_tf_exec" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "memo_board_tf_exec"%0A      + path      = "/"%0A      + policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "iam:*"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "IAMFullAccess"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "logs:*",%0A                          + "elasticloadbalancing:*",%0A                          + "ecs:*",%0A                          + "ecr:*",%0A                          + "ec2:*",%0A                          + "cloudwatch:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.memo_board_tf_exec will be created%0A  + resource "aws_iam_role_policy_attachment" "memo_board_tf_exec" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "memo-board-tf"%0A    }%0A%0APlan: 2 to add, 2 to change, 0 to destroy.%0Aaws_iam_policy.memo_board_tf_exec: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_policy.memo_board_tf1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Aaws_iam_policy.memo_board_tf_exec: Creation complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifications complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Creation complete after 0s [id=memo-board-tf-20220925063856285400000001]%0A
::debug::stderr: ╷%0A│ Error: error updating IAM policy arn:aws:iam::281036478087:policy/memo_board_tf1: MalformedPolicyDocument: Statement IDs (SID) must be alpha-numeric. Check that your input satisfies the regular expression [0-9A-Za-z]*%0A│ 	status code: 400, request id: 55ff3939-bd23-478e-b1ec-d0bbede1f674%0A│ %0A│   with aws_iam_policy.memo_board_tf1,%0A│   on iam.tf line 135, in resource "aws_iam_policy" "memo_board_tf1":%0A│  135: resource "aws_iam_policy" "memo_board_tf1" {%0A│ %0A╵%0A
::debug::exitcode: 1

::set-output name=stdout::data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3554073839]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_policy.memo_board_cd1 will be updated in-place%0A  ~ resource "aws_iam_policy" "memo_board_cd1" {%0A        id        = "arn:aws:iam::281036478087:policy/memo_board_cd1"%0A        name      = "memo_board_cd1"%0A      ~ policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Action   = "ecr:GetAuthorizationToken" -> [%0A                          + "ecs:RegisterTaskDefinition",%0A                          + "ecr:GetAuthorizationToken",%0A                        ]%0A                      ~ Sid      = "GetAuthorizationToken" -> "AllowForGeneralResources"%0A                        # (2 unchanged elements hidden)%0A                    },%0A                    {%0A                        Action   = [%0A                            "ecr:UploadLayerPart",%0A                            "ecr:PutImage",%0A                            "ecr:InitiateLayerUpload",%0A                            "ecr:GetDownloadUrlForLayer",%0A                            "ecr:CompleteLayerUpload",%0A                            "ecr:BatchGetImage",%0A                            "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                        Effect   = "Allow"%0A                        Resource = "arn:aws:ecr:ap-northeast-1:281036478087:repository/memo-board-rs"%0A                        Sid      = "AllowPushPull"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ecs:UpdateService",%0A                          + "ecs:DescribeServices",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AllowForECS"%0A                    },%0A                  + {%0A                      + Action   = "iam:PassRole"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AllowPassRole"%0A                    },%0A                ]%0A                # (1 unchanged element hidden)%0A            }%0A        )%0A        tags      = {}%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_policy.memo_board_tf1 will be updated in-place%0A  ~ resource "aws_iam_policy" "memo_board_tf1" {%0A        id        = "arn:aws:iam::281036478087:policy/memo_board_tf1"%0A        name      = "memo_board_tf1"%0A      ~ policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                    # (1 unchanged element hidden)%0A                    {%0A                        Action   = [%0A                            "s3:PutObject",%0A                            "s3:GetObject",%0A                            "s3:DeleteObject",%0A                        ]%0A                        Effect   = "Allow"%0A                        Resource = "arn:aws:s3:::hiyoko3m-tfstate/memo_board"%0A                        Sid      = ""%0A                    },%0A                  ~ {%0A                      ~ Action   = [%0A                          - "ecs:*",%0A                          - "ecr:*",%0A                          + "iam:SimulatePrincipalPolicy",%0A                          + "iam:SimulateCustomPolicy",%0A                          + "iam:List*",%0A                          + "iam:Get*",%0A                          + "iam:GenerateServiceLastAccessedDetails",%0A                          + "iam:GenerateCredentialReport",%0A                        ]%0A                      ~ Sid      = "" -> "IAMReadOnlyAccess"%0A                        # (2 unchanged elements hidden)%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "logs:TestMetricFilter",%0A                          + "logs:StopQuery",%0A                          + "logs:StartQuery",%0A                          + "logs:List*",%0A                          + "logs:Get*",%0A                          + "logs:FilterLogEvents",%0A                          + "logs:Describe*",%0A                          + "cloudwatch:List*",%0A                          + "cloudwatch:Get*",%0A                          + "cloudwatch:Describe*",%0A                          + "autoscaling:Describe*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "CloudWatchReadOnlyAccess (partial)"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:Describe*",%0A                          + "ec2:Describe*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AmazonEC2ReadOnlyAccess (partial)"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ecr:List*",%0A                          + "ecr:Get*",%0A                          + "ecr:Describe*",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "AmazonEC2ContainerRegistryReadOnly (modified)"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ecs:List*",%0A                          + "ecs:Describe*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = ""%0A                    },%0A                ]%0A                # (1 unchanged element hidden)%0A            }%0A        )%0A        tags      = {}%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_policy.memo_board_tf_exec will be created%0A  + resource "aws_iam_policy" "memo_board_tf_exec" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "memo_board_tf_exec"%0A      + path      = "/"%0A      + policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "iam:*"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "IAMFullAccess"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "logs:*",%0A                          + "elasticloadbalancing:*",%0A                          + "ecs:*",%0A                          + "ecr:*",%0A                          + "ec2:*",%0A                          + "cloudwatch:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.memo_board_tf_exec will be created%0A  + resource "aws_iam_role_policy_attachment" "memo_board_tf_exec" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "memo-board-tf"%0A    }%0A%0APlan: 2 to add, 2 to change, 0 to destroy.%0Aaws_iam_policy.memo_board_tf_exec: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_policy.memo_board_tf1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Aaws_iam_policy.memo_board_tf_exec: Creation complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifications complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Creation complete after 0s [id=memo-board-tf-20220925063856285400000001]%0A

::set-output name=stderr::╷%0A│ Error: error updating IAM policy arn:aws:iam::281036478087:policy/memo_board_tf1: MalformedPolicyDocument: Statement IDs (SID) must be alpha-numeric. Check that your input satisfies the regular expression [0-9A-Za-z]*%0A│ 	status code: 400, request id: 55ff3939-bd23-478e-b1ec-d0bbede1f674%0A│ %0A│   with aws_iam_policy.memo_board_tf1,%0A│   on iam.tf line 135, in resource "aws_iam_policy" "memo_board_tf1":%0A│  135: resource "aws_iam_policy" "memo_board_tf1" {%0A│ %0A╵%0A

::set-output name=exitcode::1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":16,"Program":"tfcmt","SHA1":"09109c6692f35e905eb8642c3b689d4c047c0d31","Vars":{},"WorkflowName":"Terraform"} -->